<template>
  <div>
    <el-alert
      v-for="(word, index) in wordList"
      :key="index"
      :title="word"
      :type="typeClass(index)"
      :closable="false"
      style="margin-bottom: 24px; font-size: 24px"
    />
  </div>
</template>

<script>
export default {
  name: "heartWords", 
  data() {
    return {
      wordList: [
        "失之非我本意，留之不忍于心，心有憾，但无悔，她乃良配，我非良人。",
        "回忆闪烁 我不愿清醒 也自愿受困。",
        "我与春风皆过客，你携秋水揽星河。",
        "愿有岁月可回首，且以深情共白头。",
        "三生有幸遇见你，纵然悲凉也是情。",
        "既许一人以偏爱，愿尽余生之慷慨。",
        "渐行渐远渐无书，水阔鱼沉何处问。",
        "天涯地角有穷时，只有相思无尽处。",
        "半身风雨半身伤，半句别恨半心凉。",
        "人生天地间，忽如远行客。",
        "只缘感君一回顾，使我思君朝与暮。",
        "寒灯纸上梨花雨凉，我等风雪又一年。",
        "此情无计可消除，才下眉头，却上心头。",
        "此情应是长相守，你若无心我便休。",
        "一别两宽，各生欢喜。",
        "此生固短，无你何欢。",
        "我断不思量，你莫思量我。",
        "侯门一入深似海，从此萧郎是路人。",
        "情如风雪无常，却是一动即殇。",
        "向来缘浅，奈何情深！",
        "与君初相识，犹如故人归。",
        "人间纵有百媚千红，唯独你是情之所钟。",
        "与君相向转向卿，与君双栖共一生。",
        "我愿提笔画尽天下，许你一世繁华。",
        "以你之名，冠我之姓。",
        "入目无别人，四下皆是你。",
        "既不回头，何必不忘。",
        "不求与君同相守，只愿伴君天涯路。",
        "别来半岁音书绝，一寸离肠千万结。",
        "海底月是天上月，眼前人是心上人。",
      ],
      typeList: ["success", "warning", "info", "error"],
    };
  },
  methods: {
    // init() {
    //   import('').then(module => {
    //   // use code
    // })
    // },
    typeClass(num) {
      return this.typeList[num % 4];
    },
  },
};
</script>
